Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпособовОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭТАвтономно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОповещатьОбОтсутствииНомераСлипЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочкаСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОрганизацииНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючКассыНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНСПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОплатыСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСсылкаСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_АдресТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИнтеграцияОплатаНаТерминал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуемыйТерминал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ПортТерминала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодключаемоеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыСпособовОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСпособовОплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Эквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СертификатНСПК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭквайринговыеТерминалы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СБП кассовая ссылка
	Элементы.СоздатьСсылку.Доступность = Не ЭтотОбъект.ТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Тип.Пустая() Тогда
		Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Эквайринг");
	КонецЕсли;
	
	НастроитьФормуПоТипу();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодключитьКассовуюСсылку(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТорговаяТочкаСБП) Тогда
		//+ОЛИМП Замена текст 1С:БИП на адаптированный
		//ПоказатьПредупреждение(,НСтр("ru = 'Не заполнена торговая точка.'"));
		ПоказатьПредупреждение(,НСтр("ru = 'Не заполнен профиль подключения к СБП.'"));
		//-ОЛИМП
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПодключитьКассовуюСсылкуЗавершение",
		ЭтотОбъект);
	
	ИнтеграцияСПлатежнымиСистемамиКлиент.ПодключитьКассовуюСсылку(
		Объект.ТорговаяТочкаСБП,
		ОписаниеОповещения,
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьСсылкуДляNFC(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.КассоваяСсылкаСБП) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не заполнена кассовая ссылка. Перед преобразованием необходимо создать ссылку.'"),
			,
			"КассоваяСсылка",
			"Объект");
		Возврат;
	КонецЕсли;
	
	Результат = ИнтеграцияСПлатежнымиСистемамиКлиентСервер.ФункциональнаяСсылкаNFC(
		Объект.КассоваяСсылкаСБП);
	Если Не ПустаяСтрока(Результат) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Успешное формирование ссылки: %1'"),
				Результат))
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСсылку(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Перед созданием кассовой ссылки необходимо записать элемент.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТорговаяТочкаСБП) Тогда
		//+ОЛИМП Замена текст 1С:БИП на адаптированный
		//ПоказатьПредупреждение(,НСтр("ru = 'Не заполнена торговая точка.'"));
		ПоказатьПредупреждение(,НСтр("ru = 'Не заполнен профиль подключения к СБП.'"));
		//-ОЛИМП
		Возврат;
	КонецЕсли;
	
	РезультатСоздания = СоздатьСсылкуНаСервере(Объект.ТорговаяТочкаСБП);
	Если Не ЗначениеЗаполнено(РезультатСоздания.КодОшибки) Тогда
		//+ОЛИМП
		// В библиотере реквизит "ИдентификаторОплаты", но у нас "ИдентификаторОплатыСБП".
		Объект.КассоваяСсылкаСБП = РезультатСоздания.КассоваяСсылка;
		Объект.ИдентификаторОплатыСБП = РезультатСоздания.ИдентификаторОплаты;
		//ЗаполнитьЗначенияСвойств(
		//	Объект,
		//	РезультатСоздания,
		//	"ИдентификаторОплаты, КассоваяСсылка");
		//-ОЛИМП
		ЭтотОбъект.Записать();
	Иначе
		ПоказатьПредупреждение(
			Неопределено,
			РезультатСоздания.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКассовойСсылки(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(1, НСтр("ru='Кассовая ссылка (А5 широкий)'"));
	СписокВыбора.Добавить(2, НСтр("ru='Кассовая ссылка (А5 только логотипы)'"));
	СписокВыбора.Добавить(3, НСтр("ru='Кассовая ссылка (А5 узкий)'"));
	СписокВыбора.Добавить(4, НСтр("ru='Кассовая ссылка (А5 узкий горизонтальный)'"));
	СписокВыбора.Добавить(5, НСтр("ru='Кассовая ссылка (А6 квадратный)'"));
	СписокВыбора.Добавить(6, НСтр("ru='Кассовая ссылка (А6 круглый)'"));
	
	ОповещениеПродолжения = Новый ОписаниеОповещения("ПечатьКассовойСсылкиПродолжение", ЭтотОбъект);
	
	ПоказатьВыборИзМеню(ОповещениеПродолжения, СписокВыбора, Элементы.ПечатьКассовойСсылки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип <> ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СБП") Тогда
		Объект.ТорговаяТочкаСБП = Неопределено;
		Объект.КассоваяСсылкаСБП = Неопределено;
		Объект.ИдентификаторОплатыСБП = Неопределено;
	КонецЕсли;
	
	НастроитьФормуПоТипу();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭТАвтономноПриИзменении(Элемент)
	НастроитьФормуПоТипу();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИспользоватьЭТАвтономно()
	Элементы.Оборудование.ТолькоПросмотр = Объект.ИспользоватьЭТАвтономно;
	Элементы.НеОповещатьОбОтсутствииНомераСлипЧека.ТолькоПросмотр = Объект.ИспользоватьЭТАвтономно;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭквайрингНСПКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ВыборЭТЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.Форма.ФормаВыбораЭквайрингаНСПК",, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭТЗавершение(Результат, ДополнительныеПарамерты) Экспорт
	
	Объект.ЭквайрингНСПК = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура КассоваяСсылкаРасширеннаяПодсказкаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:Description" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьОписаниеКассовыхСсылок();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "open:InstructionNFC" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьИнструкциюПоПрограммированиюNFCМетки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФормуПоТипу()
	
	ЭтоЭТ	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Эквайринг");
	ЭтоСБП	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СБП");
	ЭтоНСПК	 = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.СертификатНСПК");
	ЭтоПрочее = Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыСпособовОплат.Прочее");
	ЭтоПрочее = ЭтоПрочее Или Не ЗначениеЗаполнено(Объект.Тип);
	
	Если ЭтоЭТ Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиЭТ;
		
		Элементы.ГруппаПодключаемоеОбоудование.Доступность = Не Объект.ИспользоватьЭТАвтономно;
		Элементы.НеОповещатьОбОтсутствииНомераСлипЧека.Доступность = Не Объект.ИспользоватьЭТАвтономно;
		Элементы.ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ.Доступность = Объект.ИспользоватьЭТАвтономно;
		
	ИначеЕсли ЭтоСБП Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиСБП;
	ИначеЕсли ЭтоНСПК Тогда
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиНСПК;
	Иначе
		Элементы.СтраницыПоТипу.ТекущаяСтраница = Элементы.СтраницаНастройкиПрочее;
	КонецЕсли;
	
	Элементы.Касса.Доступность = Не ЭтоНСПК;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьСсылкуНаСервере(ТорговаяТочкаСБП)
	
	Возврат ИнтеграцияСПлатежнымиСистемами.КассоваяСсылка(ТорговаяТочкаСБП);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьКассовуюСсылкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.КассоваяСсылкаСБП = Результат.КассоваяСсылка;
	Объект.ИдентификаторОплатыСБП = Результат.ИдентификаторОплаты;
	ЭтотОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте 
Процедура ПечатьКассовойСсылкиПродолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(Объект.КассоваяСсылкаСБП) 
			Или Не ЗначениеЗаполнено(Объект.ИдентификаторОплатыСБП)
			Тогда
			ОбщегоНазначения.СообщитьПользователю("Печать не возможна, не заполнены данные ""Кассовая ссылка"" или ""Идентификатор оплат""");
			Возврат;
		КонецЕсли;
		
		ДанныеСсылки = Новый Структура("ИдентификаторОплаты, КассоваяСсылка", Объект.ИдентификаторОплатыСБП, Объект.КассоваяСсылкаСБП); 
		
		СтруктураПечати = ПечатьКассовойСсылкиПолучитьСтруктуруПечати(ДанныеСсылки, Результат.Значение);
		ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураПечати, Неопределено); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьКассовойСсылкиПолучитьСтруктуруПечати(ДанныеСсылки, ТипПечати)
	
	ТабДок = ИнтеграцияСПлатежнымиСистемами.СформироватьКарточкуКассовойСсылки(ДанныеСсылки, Новый Структура("ТипПечати", ТипПечати));
	СтруктураПечати = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок);
	Возврат СтруктураПечати;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьИнструкциюПоПрограммированиюNFCМетки() Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		"https://downloads.v8.1c.ru/content/Instruction/programming-NFC-tags.pdf");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписаниеКассовыхСсылок() Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
		"https://v8.1c.ru/cash-qrs");
	
КонецПроцедуры

#КонецОбласти
